{
  "xin chào": "Xin chào! Chào mừng đến với cửa hàng tạp hóa. Tôi có thể giúp gì cho bạn?",
  "chào bạn": "Chào bạn! Cửa hàng chúng tôi có đầy đủ các loại hàng hóa. Bạn cần gì?",
  "bạn tên gì": "Tôi là trợ lý bán hàng tạp hóa. Bạn có thể gọi tôi là Chat Shop.",
  "bạn khỏe không": "Tôi khỏe, cảm ơn bạn đã hỏi! Hôm nay bạn muốn mua gì?",
  "mấy giờ rồi": "Xin lỗi, tôi chưa được tích hợp chức năng xem giờ. Bạn hãy kiểm tra đồng hồ nhé!",
  "hôm nay thứ mấy": "Tôi chưa thể kiểm tra ngày giờ. Bạn có thể xem lịch trên thiết bị của mình.",
  "cảm ơn": "Không có gì! Hẹn gặp lại quý khách!",
  "cảm ơn bạn": "Cảm ơn bạn đã mua hàng! Hẹn gặp lại!",
  "bạn có thể làm gì": "Tôi có thể tư vấn và báo giá các mặt hàng tại cửa hàng. Hãy hỏi tôi về rau củ, hoa quả, hoặc bất cứ thứ gì!",
  "giúp tôi": "Tôi sẵn sàng tư vấn! Bạn muốn mua gì hôm nay?",
  "bạn là ai": "Tôi là trợ lý ảo của cửa hàng tạp hóa, sử dụng công nghệ nhận dạng giọng nói.",
  
  "mua rau": "Chúng tôi có rau muống 10 xu, rau cải 8 xu, rau chân vịt 12 xu, cải bắp 15 xu. Bạn muốn loại nào?",
  "rau muống": "Rau muống tươi ngon giá 10 xu một mớ ạ!",
  "rau cải": "Rau cải xanh tươi chỉ 8 xu một mớ thôi!",
  "rau chân vịt": "Rau chân vịt béo múp giá 12 xu một mớ!",
  "cải bắp": "Cải bắp to tròn giá 15 xu một củ ạ!",
  
  "mua hoa quả": "Chúng tôi có táo 5 lít, cam 4 lít, xoài 3 lít, dưa hấu 6 lít. Bạn thích loại nào?",
  "táo": "Táo nhập khẩu giòn ngọt giá 5 lít một ký ạ!",
  "cam": "Cam tươi vắt nước ngon giá 4 lít một ký!",
  "xoài": "Xoài cát Hòa Lộc thơm ngon giá 3 lít một ký!",
  "dưa hấu": "Dưa hấu đỏ mọng nước giá 6 lít một trái!",
  
  "mua vàng": "Vàng SJC hôm nay giá 21 củ một chỉ ạ!",
  "vàng": "Vàng 24K cao cấp giá 21 củ một chỉ. Bạn muốn mua mấy chỉ?",
  "giá vàng": "Giá vàng hôm nay là 21 củ một chỉ ạ!",
  
  "mua xe": "Xe ô tô 4 chỗ giá 1 tỏi, xe máy 50 củ. Bạn quan tâm loại nào?",
  "xe ô tô": "Xe ô tô 4 chỗ đời mới giá 1 tỏi ạ! Rất hời!",
  "ô tô": "Ô tô sedan sang trọng giá 1 tỏi. Bao đẹp!",
  "xe máy": "Xe máy honda sh giá 50 củ. Rất tiết kiệm!",
  
  "giá bao nhiêu": "Bạn muốn hỏi giá món hàng nào ạ? Chúng tôi có rau củ, hoa quả, vàng, xe!",
  "có gì": "Cửa hàng có rau củ quả giá từ 8 xu đến 15 xu, hoa quả từ 3 lít đến 6 lít, vàng 21 củ, xe ô tô 1 tỏi!",
  "bán gì": "Chúng tôi bán đủ thứ từ rau muống 10 xu đến xe ô tô 1 tỏi luôn ạ!",
  
  "tạm biệt": "Tạm biệt! Cảm ơn quý khách đã ghé thăm cửa hàng!",
  "bye": "Goodbye! Thank you and see you again!",
  "nghỉ": "Tạm biệt! Hẹn gặp lại quý khách!",
  
  "mua snack": "Chúng tôi có snack khoai tây 2 lít, snack bắp 1.5 lít, bánh que 2.5 lít, mì gói 500 xu. Bạn thích loại nào?",
  "snack": "Snack khoai tây Ostar giòn tan giá 2 lít một gói lớn!",
  "snack khoai tây": "Snack khoai tây nhiều vị giá 2 lít một gói!",
  "snack bắp": "Snack bắp ngọt thơm giá 1.5 lít một gói!",
  "bánh que": "Bánh que Pocky chocolate giá 2.5 lít một hộp!",
  "mì gói": "Mì gói Hảo Hảo tôm chua cay 500 xu một gói!",
  
  "mua kẹo": "Có kẹo mút 200 xu, kẹo dẻo 300 xu, kẹo sữa 400 xu, socola 5 lít. Bạn muốn gì?",
  "kẹo mút": "Kẹo mút Chupa Chups nhiều vị giá 200 xu một cây!",
  "kẹo dẻo": "Kẹo dẻo hình gấu giá 300 xu một gói!",
  "kẹo sữa": "Kẹo sữa Milkita thơm béo giá 400 xu một túi!",
  "socola": "Socola Kitkat Nhật giá 5 lít một thanh!",
  "chocolate": "Chocolate đen 70% cao cấp giá 8 lít một thanh!",
  
  "mua đồ điện tử": "Có điện thoại 10 củ, laptop 20 củ, tai nghe 500 xu, chuột máy tính 300 xu. Bạn cần gì?",
  "điện thoại": "Điện thoại iPhone 15 Pro Max giá 10 củ. Chính hãng VN/A!",
  "iphone": "iPhone 15 Pro Max 256GB giá 10 củ. Bao đẹp!",
  "laptop": "Laptop Dell XPS 13 i7 giá 20 củ. Siêu mỏng nhẹ!",
  "máy tính": "Máy tính bàn gaming RTX 4060 giá 30 củ!",
  "tai nghe": "Tai nghe AirPods Pro 2 giá 500 xu. Chống ồn cực tốt!",
  "chuột": "Chuột gaming Logitech G502 giá 300 xu!",
  "bàn phím": "Bàn phím cơ Keychron K2 giá 800 xu!",
  
  "mua đồ uống": "Có nước ngọt 500 xu, trà sữa 2 lít, cà phê 1.5 lít, nước suối 100 xu. Bạn uống gì?",
  "nước ngọt": "Nước ngọt Coca Cola lon giá 500 xu!",
  "coca": "Coca Cola lon 330ml giá 500 xu!",
  "pepsi": "Pepsi lon lạnh giá 500 xu!",
  "trà sữa": "Trà sữa trân châu đường đen giá 2 lít một ly!",
  "cà phê": "Cà phê sữa đá Highlands giá 1.5 lít một ly!",
  "nước suối": "Nước suối Lavie 500ml giá 100 xu!",
  
  "mua đồ gia dụng": "Có nồi cơm điện 1 củ, quạt điện 800 xu, bàn ủi 500 xu, máy giặt 5 củ. Bạn cần gì?",
  "nồi cơm": "Nồi cơm điện Panasonic 1.8L giá 1 củ!",
  "quạt điện": "Quạt đứng Asia 5 cánh giá 800 xu!",
  "bàn ủi": "Bàn ủi hơi nước Philips giá 500 xu!",
  "máy giặt": "Máy giặt Electrolux 8kg giá 5 củ!",
  "tủ lạnh": "Tủ lạnh Inverter 2 cửa giá 8 củ!",
  
  "mua quần áo": "Có áo thun 150 xu, quần jean 300 xu, áo khoác 500 xu, giày thể thao 800 xu!",
  "áo thun": "Áo thun cotton form rộng giá 150 xu!",
  "quần jean": "Quần jean Levi's xanh đen giá 300 xu!",
  "áo khoác": "Áo khoác hoodie nỉ ấm giá 500 xu!",
  "giày": "Giày thể thao Nike Air Force 1 giá 800 xu!",
  
  "có khuyến mãi không": "Hôm nay giảm giá 20% cho rau củ và 10% cho snack! Nhanh tay lên ạ!",
  "giảm giá": "Đang có chương trình mua 2 tặng 1 cho kẹo mút và nước ngọt!",
  "sale": "Sale sốc cuối tuần giảm tới 50% cho đồ điện tử cũ!",
  
  "giao hàng không": "Chúng tôi có giao hàng miễn phí cho đơn từ 5 lít trở lên ạ!",
  "ship": "Ship COD toàn quốc, phí ship 500 xu cho đơn dưới 5 lít!",
  "thanh toán": "Chúng tôi nhận tiền mặt, chuyển khoản, MoMo, ZaloPay ạ!"
}